const msg = "Hello my friend";

//% split

// console.log(msg.split(' '));

//% join

const arr = ["Ivan", "Ira", "Igor"];

// console.log(arr.join('-'));

// Методи indexOf() і includes()

// console.log(arr.indexOf('Igor'));

// console.log(arr.includes('Ivans'));

//% Перевірка множинних умов з includes()

const fruit = "qwerty";

// if(fruit === "sdfgh" || fruit === "sdfdfhgh" || fruit === "qwerty" ){
//     console.log("Такий фрукт є!");
//   }

const fruits = ["apple", "strawberry", "cherry", "cranberries"];

// console.log(fruits.includes('cherry'));

// if(fruits.includes('cherry')){
//     console.log("Такий фрукт є!");
// }

//% Методи push(), pop(), shift(), unshift()

// fruits.push("mango")
// console.log(fruits);

// fruits.pop("mango")

// console.log(fruits);

// ========================== Метод  slice() =========================
// slice(begin, end)
// Копіює елементи від begin, до, але не ключа, end.

// const newArr = fruits.slice(1, 3)
// const newArr = fruits.slice(0)
// const newArr = fruits.slice(1, fruits.length - 1 )

// console.log(newArr);

// ========================== Метод  splice() =========================

// splice(position, num)

const scores = [1, 2, 3, 4, 5];

const arrOld = [6, 7, 8, 9, 10, 11, 12];

const deleteElement = scores.splice(2, 3); // видалення 3-ох елементів починаючи з 2індекса

scores.splice(1, 0, 10, 11, 12); // Добавлення елементів в масив

scores.splice(2, 3, 10, 11, 12); // Заміна елементів у будь яку частину масиву

// console.log(scores);
// console.log(scores);

// ========================== Метод  concat() =========================

// scores.concat(arrOld);
//

const arrBoth = scores.concat(arrOld);

// console.log(arrBoth);

// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================
// ======================================================================

// ДЗ:
//% Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10.

const numbersArray = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1];

numbersArray[1] = 10;

// console.log("numbersArray :>> ", numbersArray);

//% Створити масив із трьох рядків. Додати до масиву ще одну рядків.

//% Створити скрипт який поверне суму всіх чисел в масиві.
//% Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.
//% Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів.
//% Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.
//% Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.

// const newArray = [1, 2, 3, 4, 5, 6, 7, 8, 9];

// const names = ["Igor",  "Roman", "Svyatoslav"]

const str = "Igor Roman Svyatoslav"
// console.log('newArray :>> ', newArray);
// console.log('names :>> ', names);


// for (let i = 0; i < names.length; i++) {
//   // console.log('i :>> ', i);
//   const element = names[i];
//   // console.log( element);
// }

const namesOfArray = str.split(' ')
console.log(namesOfArray);

const arrOfStr = namesOfArray.join(' ')

console.log(arrOfStr);

