console.log('Hello! :>> ');


// for(Ініціалізація; Умова; ПостВираз ){
//    // Тіло циклу 
// 

// for (початок; умова; крок) {
  // ... тіло циклу ...
// }

// *Початок* виконання
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → ...



// i = i + 1

// const max = 20;

// for(let i = 15; i <= max; i += 1 ){
// console.log(i);
// }


// Порахуємо суму чисел до певного значення.

// const target = 3;
// let sum = 0;


// for(let i = 0; i <= target; i += 1 ){
//     sum += i
    // console.log('i :>> ', i);
    // console.log('sum :>> ', sum);
// }

// console.log('sum :>> ', sum);

// for (let i = 0; i < 10; i += 1) {
//     if (i === 6) {
//         break;
//     }
//     console.log('i :>> ', i);
//   }
  

//   const number = 10;
// for (let i = 1; i <= number; i += 1) {
//   if (i % 2 === 0) {
//     continue;
//   }
//   console.log('Непарне i: ', i); // 3 1,, 5, 7, 9
// }





// ==================================== while ======================

// while (умова) {
//   // код
//   // так зване "тіло циклу"
// }

// let i = 30;
// while (i > 0) {
//   console.log(i);
//   i -= 1;
// }



// let clientCounter = 18;
// const maxClients = 25;

// while (clientCounter <= maxClients) {
//   console.log(clientCounter);
//   clientCounter += 1;
// }



// ====================================do...while ======================

// do {
//   // тіло циклу
// } while (умова);

// let i = 0;
// do{
// // alert("Привіт! Це значення і до виконаннфя циклу.")
// console.log(i);
// i += 1;
// } while (i <= 20) 




// let password = "";

// do {
//   password = prompt("Введіть пароль довший 4-х символів");
// } while (password.length < 5);

// console.log("Ввели пароль: ", password);

  // =============================================


  // let i = 0;
// while (i < 6) {
//   console.log(i);
//   i += 1;
// }

// for(let i = 0; i < 6; i += 1){
//   console.log(i);
  
// }


// *Початок* виконання
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → (Якщо *умова* == true → виконати тіло і виконати крок)
// → ...


// for (let i = 0; i < 3; i += 1) alert(i)

// // Початок виконання
// let i = 0
// // Якщо умова == true → виконати тіло і виконати крок


// if (i < 3) {
//    console.log(i); 
//     i += 1 
//   }
// // Якщо умова == true → виконати тіло і виконати крок
// if (i < 3) { console.log(i); i += 1 }
// // Якщо умова == true → виконати тіло і виконати крок
// if (i < 3) { console.log(i); i += 1 }
// // ...кінець, тому що зараз i == 3